Tekla Open API Reference for Tekla Structures 2025
LoadGroup.LoadGroupType Enumeration
 The possible types for load groups.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LoadGroupType
Public Enumeration LoadGroupType
Members
Member name | Value | Description
EUROCODE_DEFAULT_GROUP | 1000 |  The Eurocode default group type.
EUROCODE_SELF_WEIGHT | 1001 |  The Eurocode self weight type.
EUROCODE_PERMANENT_LOAD | 1002 |  The Eurocode permanent load type.
EUROCODE_PRE_STRESS_LOAD | 1003 |  The Eurocode pre-stress load type.
EUROCODE_LIVE_LOAD_HOUSING | 1004 |  The Eurocode live load housing type.
EUROCODE_LIVE_LOAD_PUBLIC_BUILDINGS | 1005 |  The Eurocode live load public buildings type.
EUROCODE_LIVE_LOAD_THEATRES_RESTAURANTS | 1006 |  The Eurocode live load theatres, restaurants type.
EUROCODE_LIVE_LOAD_WAREHOUSES | 1007 |  The Eurocode live load warehouses type.
EUROCODE_LIVE_LOAD_STORAGE_BUILDINGS | 1008 |  The Eurocode live load storage buildings type.
EUROCODE_TRAFFIC_LOAD_LIGHT_VEHICLES | 1009 |  The Eurocode traffic load light vehicles type.
EUROCODE_TRAFFIC_LOAD_HEAVY_VEHICLES | 1010 |  The Eurocode traffic load heavy vehicles type.
EUROCODE_TRAFFIC_LOAD_ROOFS | 1011 |  The Eurocode traffic load roofs type.
EUROCODE_SNOW_LOAD | 1012 |  The Eurocode snow load type.
EUROCODE_WIND_LOAD | 1013 |  The Eurocode wind load type.
EUROCODE_FORCES_DUE_TO_TEMPERATURE_EFFECTS | 1014 |  The Eurocode forces due to temperature effects type.
EUROCODE_IMPERFECTION_LOAD_DUE_TO_DEAD_LOADS | 1015 |  The Eurocode imperfection load due to dead loads type.
EUROCODE_IMPERFECTION_LOAD_DUE_TO_LIVE_LOADS | 1016 |  The Eurocode imperfection load due to live loads type.
EUROCODE_IMPERFECTION_LOAD_DUE_TO_SNOW_LOADS | 1017 |  The Eurocode imperfection load due to snow loads type.
EUROCODE_ACCIDENTAL_LOAD | 1018 |  The Eurocode accidental load type.
EUROCODE_EARTHQUAKE_LOAD | 1019 |  The Eurocode earthquake load type.
BRITISH_CODE_DEAD_LOAD_ALONE | 2001 |  The British code dead load alone type.
BRITISH_CODE_DEADLOAD | 2002 |  The British code dead load type.
BRITISH_CODE_IMPOSED_LOAD | 2003 |  The British code imposed load type.
BRITISH_CODE_WIND_LOAD | 2004 |  The British code wind load type.
BRITISH_CODE_TEMPERATURE_LOAD | 2005 |  The British code temperature load type.
BRITISH_CODE_VERTICAL_CRANE_LOAD | 2006 |  The British code vertical crane load type.
BRITISH_CODE_HORIZONTAL_CRANE_LOAD | 2007 |  The British code horizontal crane load type.
AISC_DEAD_LOAD_ALONE | 3001 |  The AISC dead load alone type.
AISC_DEAD_LOAD | 3002 |  The AISC dead load type.
AISC_LIVE_LOAD | 3003 |  The AISC live load type.
AISC_ROOF_LIVE_LOAD | 3004 |  The AISC roof live load type.
AISC_WIND_LOAD | 3005 |  The AISC wind load type.
AISC_SNOW_LOAD | 3006 |  The AISC snow load type.
AISC_RAINWATER_LOAD | 3007 |  The AISC rainwater load type.
AISC_EARTHQUAKE_LOAD | 3008 |  The AISC earthquake load type.
CM66_PERMANENT_LOAD_FR | 6001 |  The CM66 permanent load type.
CM66_EXPLOITATION_LOAD_FR | 6002 |  The CM66 exploitation load type.
CM66_TEMPERATURE_LOAD_FR | 6003 |  The CM66 temperature load type.
CM66_WIND_LOAD_FR | 6004 |  The CM66 wind load type.
CM66_SNOW_LOAD_FR | 6005 |  The CM66 snow load type.
CM66_SEISMIC_LOAD_HORIZONTAL_FR | 6006 |  The CM66 seismic load horizontal type.
CM66_SEISMIC_LOAD_VERTICAL_FR | 6007 |  The CM66 seismic load vertical type.
BAEL91_PERMANENT_LOAD_FR | 7001 |  The BAEL91 permanent load type.
BAEL91_EXPLOITATION_LOAD_FR | 7002 |  The BAEL91 exploitation load type.
BAEL91_TEMPERATURE_LOAD_FR | 7003 |  The BAEL91 temperature load type.
BAEL91_WIND_LOAD_FR | 7004 |  The BAEL91 wind load type.
BAEL91_SNOW_LOAD_FR | 7005 |  The BAEL91 snow load type.
BAEL91_SEISMIC_LOAD_FR | 7006 |  The BAEL91 seismic load type.
BAEL91_ACCIDENTAL_LOAD_FR | 7007 |  The BAEL91 accidental load type.
UBC_DEAD_LOAD | 8001 |  The UBC dead load type.
UBC_LIVE_LOAD | 8002 |  The UBC live load type.
UBC_ROOF_LIVE_LOAD | 8003 |  The UBC roof live load type.
UBC_WIND_LOAD | 8004 |  The UBC wind load type.
UBC_SNOW_LOAD | 8005 |  The UBC snow load type.
UBC_TEMPERATURE_LOAD | 8006 |  The UBC temperature load type.
UBC_FLUIDS_LOAD | 8007 |  The UBC fluids load type.
UBC_SOIL_LOAD | 8008 |  The UBC soil load type.
UBC_PONDING_LOAD | 8009 |  The UBC ponding load type.
UBC_SEISMIC_LOAD | 8010 |  The UBC seismic load type.
IBC_DEAD_LOAD | 9001 |  The IBC dead load type.
IBC_LIVE_LOAD | 9002 |  The IBC live load type.
IBC_ROOF_LIVE_LOAD | 9003 |  The IBC roof live load type.
IBC_WIND_LOAD | 9004 |  The IBC wind load type.
IBC_SNOW_LOAD | 9005 |  The IBC snow load type.
IBC_TEMPERATURE_LOAD | 9006 |  The IBC temperature load type.
IBC_FLUIDS_LOAD | 9007 |  The IBC fluids load type.
IBC_SOIL_LOAD | 9008 |  The IBC soil load type.
IBC_RAIN_LOAD | 9009 |  The IBC rain load type.
IBC_PONDING_LOAD | 9010 |  The IBC ponding load type.
IBC_SEISMIC_LOAD | 9011 |  The IBC seismic load type.
ACI_DEAD_LOAD | 9101 |  The ACI dead load type.
ACI_LIVE_LOAD | 9102 |  The ACI live load type.
ACI_ROOF_LIVE_LOAD | 9103 |  The ACI roof live load type.
ACI_WIND_LOAD | 9104 |  The ACI wind load type.
ACI_SEISMIC_LOAD | 9105 |  The ACI seismic load type.
ACI_SNOW_LOAD | 9106 |  The ACI snow load type.
ACI_FLUIDS_LOAD | 9107 |  The ACI fluids load type.
ACI_SOIL_LOAD | 9108 |  The ACI soil load type.
ACI_RAIN_LOAD | 9109 |  The ACI rain load type.
ACI_TEMPERATURE_LOAD | 9110 |  The ACI temperature load type.
See Also
Reference
Tekla.Structures.Model Namespace